{
  "document_title": "International Student Life Cycle - Arrival Process for Bachelor's Students (F-1 Status)",
  "audience": "International students pursuing bachelor's degree programs in the United States",
  "visa_category": "F-1",
  "education_level": "Bachelor's",
  "sections": [
    {
      "section_id": "overview",
      "section_title": "Overview",
      "content": [
        "International students in the United States are considered nonimmigrants because their sole purpose for being in the country is to complete a program of study at a Student and Exchange Visitor Program (SEVP)-certified school.",
        "An F-1 nonimmigrant is an international student in the United States pursuing a full course of academic or professional study at an SEVP-certified school, including language training programs.",
        "An F-2 nonimmigrant is the spouse or qualifying child of an F-1 student.",
        "Bachelor's degree programs fall under F-1 status because they are academic programs offered by SEVP-certified schools."
      ]
    },
    {
      "section_id": "getting_started",
      "section_title": "Getting Started",
      "content": [
        "Students who want to study in the United States should begin by researching schools and programs that match their academic goals and qualifications.",
        "Only SEVP-certified schools are authorized to enroll F and M nonimmigrant students.",
        "Prospective students are encouraged to seek advising and explore educational resources to better understand available programs and financial planning options.",
        "Individuals already in the United States on a valid nonimmigrant visa for a non-study purpose may be eligible to change their status in order to enroll in school."
      ]
    },
    {
      "section_id": "preparing_to_study",
      "section_title": "Preparing to Study in the United States",
      "content": [
        "After acceptance to an SEVP-certified school, students receive a Form I-20, which is the official record of their information in the Student and Exchange Visitor Information System (SEVIS).",
        "If multiple schools issue a Form I-20, the student must use only the form from the school they plan to attend.",
        "Students must review the Form I-20 carefully to ensure their personal information matches their passport details and request corrections if necessary.",
        "Once the Form I-20 is confirmed to be accurate, students must pay the I-901 SEVIS Fee.",
        "After paying the SEVIS fee, students must apply for and receive a student visa issued by the U.S. Department of State before traveling to the United States."
      ]
    },
    {
      "section_id": "entering_the_us",
      "section_title": "Entering the United States",
      "subsections": [
        {
          "subsection_id": "timing",
          "subsection_title": "Timing",
          "content": [
            "Students and their dependents may enter the United States up to 30 days before the official program start date listed on the Form I-20."
          ]
        },
        {
          "subsection_id": "port_of_entry",
          "subsection_title": "At the Port of Entry",
          "content": [
            "U.S. Customs and Border Protection officers admit international students at U.S. ports of entry.",
            "Students should carry all required immigration and travel documents with them and present them upon arrival.",
            "Required documents should not be placed in checked luggage."
          ]
        },
        {
          "subsection_id": "document_preparation",
          "subsection_title": "Document Preparation",
          "content": [
            "Students are advised to make multiple copies of all travel and immigration documents.",
            "One copy should be left with family members before departure, and another provided to school officials after arrival.",
            "Original documents should be stored securely after entering the United States."
          ]
        }
      ]
    }
  ],
  "source": {
    "publisher": "Study in the States",
    "government_agency": "U.S. Department of Homeland Security",
    "content_type": "Official guidance",
    "last_accessed": "DATE_OF_SCRAPING"
  },
  "disclaimer": "This information is provided for general guidance only and does not constitute legal advice. Students should confirm requirements with their designated school official or U.S. government authorities."
}
