{
  "document_title": "Programs of Study for College Students",
  "audience": "International students studying in the United States",
  "visa_categories": ["F-1", "M-1"],
  "education_scope": "Postsecondary education (excluding K-12)",
  "sections": [
    {
      "section_id": "overview",
      "section_title": "Overview",
      "content": [
        "The United States offers a wide variety of academic and vocational program options for F-1 and M-1 students.",
        "All programs attended by F or M students must be certified by the Student and Exchange Visitor Program (SEVP).",
        "Only SEVP-certified schools and programs are eligible to enroll international students under F or M nonimmigrant status.",
        "Programs of study for college students exclude kindergarten through grade 12 education."
      ]
    },
    {
      "section_id": "community_colleges",
      "section_title": "Community Colleges",
      "content": [
        "Community colleges, also known as junior colleges, are two-year institutions that provide affordable postsecondary education.",
        "These institutions often serve as a pathway for students who intend to transfer to a four-year college or university.",
        "Community colleges offer an option for students seeking a cost-effective entry into higher education in the United States."
      ]
    },
    {
      "section_id": "stem_programs",
      "section_title": "STEM Programs",
      "content": [
        "STEM programs include fields related to science, technology, engineering, and mathematics.",
        "Many SEVP-certified schools offer undergraduate and graduate programs in STEM disciplines.",
        "International students commonly pursue STEM programs due to their academic rigor and career opportunities."
      ]
    },
    {
      "section_id": "undergraduate_and_graduate",
      "section_title": "Undergraduate and Graduate Schools",
      "content": [
        "International students may enroll in undergraduate programs to earn associate or bachelor's degrees.",
        "Graduate programs allow students to pursue master's or doctoral degrees.",
        "Each academic program varies in structure and requirements, making it important for students to research programs carefully.",
        "Students should select programs that align with their academic interests and long-term goals."
      ]
    },
    {
      "section_id": "english_language_training",
      "section_title": "English Language Training",
      "content": [
        "English language training programs are designed for international students who want to improve their English proficiency.",
        "SEVP recognizes two categories of English language training programs: stand-alone and combined programs.",
        "Stand-alone English language training programs offer only English language instruction.",
        "Combined English language training programs offer English language instruction alongside other academic programs.",
        "The term English language training is used interchangeably with ESL, ESOL, and Intensive English Programs."
      ]
    }
  ],
  "definitions": {
    "SEVP": "The Student and Exchange Visitor Program, which certifies schools and programs authorized to enroll international students.",
    "STEM": "Academic fields related to science, technology, engineering, and mathematics."
  },
  "source": {
    "publisher": "Study in the States",
    "government_agency": "U.S. Department of Homeland Security",
    "content_type": "Official educational guidance",
    "last_accessed": "DATE_OF_SCRAPING"
  },
  "disclaimer": "This content is provided for informational purposes only and does not constitute legal or immigration advice."
}
