{
  "document_title": "Important Notes for College Students",
  "audience": "International college students in the United States",
  "visa_category": "F-1",
  "education_level": "Higher Education",
  "sections": [
    {
      "section_id": "important_notes",
      "section_title": "Important Notes for College Students (F-1 Status)",
      "content": [
        "Only schools certified by the Student and Exchange Visitor Program (SEVP) are authorized to enroll F-1 students.",
        "Students pursuing bachelor's, master's, or doctoral degree programs must select Higher Education as the education type when searching for schools.",
        "Students must verify that a school is certified for F-1 visa status before applying or enrolling.",
        "Some universities operate multiple campuses, and students should review all available campuses before making a decision.",
        "The primary or main campus of a school is typically identified separately from satellite campuses.",
        "Search tools allow students to filter schools by geographic location, education type, and visa eligibility.",
        "Students may access a downloadable list of all SEVP-certified schools for offline reference.",
        "Because thousands of schools are certified, using search filters is essential to identifying programs that match academic and visa requirements."
      ]
    }
  ],
  "definitions": {
    "SEVP": "The Student and Exchange Visitor Program, which certifies schools authorized to enroll international students.",
    "Higher Education": "Postsecondary academic programs including bachelor's, master's, and doctoral degrees."
  },
  "source": {
    "publisher": "Study in the States",
    "government_agency": "U.S. Department of Homeland Security",
    "content_type": "Official guidance for international students",
    "last_accessed": "DATE_OF_SCRAPING"
  },
  "disclaimer": "This content is provided for informational purposes only and does not constitute legal or immigration advice."
}

